app/views/planns/_form.html.erb

    <%= form.label :robotidd %>
 <%= form.collection_select(:robotidd, Robot.all, :robotidd,:title, { :prompt => 'Select a Robot', :selected => @robotidd}, { class: 'form-control' }) %>
---
SELECT "robots".* FROM "robots"

    <%= form.label :projectidd %>
    <%= form.collection_select(:projectidd, Project.all, :projectidd,:title, { :prompt => 'Select a Project', :selected => @projectidd}, { class: 'form-control' }) %>
---
SELECT "projects".* FROM "projects"